Revit 2027 API
ParameterTypeId.ForegroundAnyPatternIdParam Property
 "Foreground Fill Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ForegroundAnyPatternIdParam { get; }
Public Shared ReadOnly Property ForegroundAnyPatternIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ForegroundAnyPatternIdParam {
	ForgeTypeId^ get ();
}
static member ForegroundAnyPatternIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace